lib/tasks/dev.rake

INSERT INTO "contacts" ("name", "email", "birthdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Pres. Wilson Senger"], ["email", "raphael.lynch@toy.com"], ["birthdate", "1965-09-21"], ["created_at", "2022-07-02 14:28:45.145817"], ["updated_at", "2022-07-02 14:28:45.145817"]]
---
  task setup: :environment do
    puts "Cadastrando os contatos"
    100.times do |i|
      Contact.create!(
        name:Faker::Name.name ,
        email:Faker::Internet.email,
        birthdate:Faker::Date.between(from: '1950-09-23', to: '2000-09-25')
      )